app/controllers/auth/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT `questions`.* FROM `questions`

  def new
    @question = Question.new
    @auth_topics = Auth::Topic.all
---
SELECT `auth_topics`.* FROM `auth_topics`

  def create
    @question = Question.new(question_params)
    @question.user_id = current_user.id
    @question.topic_id = params[:question][:topic]
    if @question.save
---
INSERT INTO `questions` (`title`, `body`, `whyt`, `user_id`, `created_at`, `updated_at`, `topic_id`, `project_files_id`, `project_files_filename`, `project_files_size`, `project_files_content_type`) VALUES ('Please help!', 'I am curious on my rails application. I need help but im not sure where to start!!', 'I have gone to the ends of the earth trying to figure this out.', 1, '2020-01-16 15:12:27', '2020-01-16 15:12:27', 3, '84e27ac97e14d93d78d0742fbb897a17cca9a81389236441dee70a1190cd', 'ry.zip', '168', 'application/zip')

  def show
    @question = Question.find(params[:qid])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 24 LIMIT 1

  def edit
  	@question = Question.find(params[:qid])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 3 LIMIT 1

  def update
  	@question = Question.find(params[:id])
  	if @question.update(question_params)
---
SELECT  `questions`.* FROM `questions` WHERE (28) LIMIT 1
UPDATE `questions` SET `title` = '', `body` = 'I am stuck on my java ### project', `updated_at` = '2020-01-14 18:35:36' WHERE `questions`.`id` = 28

  def destroy
    @question = Question.find(params[:qid])
    @question.responses.each do |r|
      r.destroy
    end
    @question.destroy
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 23 LIMIT 1
SELECT  `questions`.* FROM `questions` WHERE (17) LIMIT 1
SELECT `responses`.* FROM `responses` WHERE `responses`.`question_id` = 23
DELETE FROM `responses` WHERE `responses`.`id` = 1
DELETE FROM `questions` WHERE `questions`.`id` = 23

  def delete
    @question = Question.find(params[:qid])
---
SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 23 LIMIT 1