app/controllers/auth/responses_controller.rb

SELECT `responses`.* FROM `responses`
---
  def index
    @responses = Response.all

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
---
  def new
    @response = Response.new
    @question = Question.find(params[:qid])

INSERT INTO `responses` (`body`, `user_id`, `question_id`, `created_at`, `updated_at`, `project_files_id`, `project_files_filename`, `project_files_size`, `project_files_content_type`) VALUES ('hf', 1, 26, '2020-01-14 18:01:10', '2020-01-14 18:01:10', '9d51fb9784aa87e7a84f5751c7dc895d2fa3122bc7666ff88c7497ebef6a', 'ry.zip', '168', 'application/zip')
---
  def create
    puts "parameest"

    @response = Response.new(response_params)
    puts @response.question.id
    if @response.save

SELECT  `responses`.* FROM `responses` WHERE `responses`.`id` = 10 LIMIT 1
---
  def show
     @response = Response.find(params[:id])

SELECT  `responses`.* FROM `responses` WHERE `responses`.`id` = 6 LIMIT 1
---
  def edit
  	@response = Response.find(params[:id])

SELECT  `responses`.* FROM `responses` WHERE `responses`.`id` = 6 LIMIT 1
UPDATE `responses` SET `body` = 'New Response1', `updated_at` = '2019-10-17 14:58:41' WHERE `responses`.`id` = 1
---
  def update
  	@response = Response.find(params[:id])
  	if @response.update(response_params)

SELECT  `responses`.* FROM `responses` WHERE `responses`.`id` = 13 LIMIT 1
DELETE FROM `responses` WHERE `responses`.`id` = 13
---
  def destroy
    @response = Response.find(params[:qid])
    @response.destroy