app/controllers/auth/topics_controller.rb

SELECT `auth_topics`.* FROM `auth_topics`
---
  def index
    @auth_topics = Auth::Topic.all

SELECT  `auth_topics`.* FROM `auth_topics` WHERE `auth_topics`.`id` = 4 LIMIT 1  [["id", 4], ["LIMIT", 1]]
---
  def show
    @topic = Auth::Topic.find(params[:id])

INSERT INTO `auth_topics` (`title`, `created_at`, `updated_at`) VALUES ('Java', '2019-11-25 16:34:03', '2019-11-25 16:34:03')
---
  def create
    @auth_topic = Auth::Topic.new(auth_topic_params)

    respond_to do |format|
      if @auth_topic.save

UPDATE `auth_topics` SET `title` = 'Rail', `updated_at` = '2020-01-02 14:54:19' WHERE `auth_topics`.`id` = 13
---
  def update
    respond_to do |format|
      if @auth_topic.update(auth_topic_params)

DELETE FROM `auth_topics` WHERE `auth_topics`.`id` = 3
---
  def destroy
    @auth_topic.destroy

SELECT  `auth_topics`.* FROM `auth_topics` WHERE `auth_topics`.`id` = 3 LIMIT 1
---
    def set_auth_topic
      @auth_topic = Auth::Topic.find(params[:id])