app/controllers/auth/users_controller.rb

  def index
    @users = User.order(email: :asc)
    @roles = Role.all
---
SELECT `users`.* FROM `users` ORDER BY `users`.`email` ASC
SELECT `roles`.* FROM `roles`

  def update_roles
    @user = User.find(params[:id])
    puts "hello"
    @user.roles = []
    Role.all.each do |r|
      if (params[r.title])
        puts r.title + " has the value " + params[r.title]
      @user.roles << r
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `roles`.* FROM `roles`
INSERT INTO `roles_users` (`role_id`, `user_id`) VALUES (5, 1)