app/views/auth/questions/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 1
---
    <div class="card-header">
      <b>ID: <%= question.id %></b> <b> Posted by: <%= question.user.email %> Role: <% question.user.roles.each do |r| %> <%= r.title %><%end%></b>