app/views/auth/questions/show.html.erb

  <div class="card-body">
    <h5 class="card-title"><% @question.responses.each do |r| %>
---
SELECT `responses`.* FROM `responses` WHERE `responses`.`question_id` = 17