app/policies/question_policy.rb

SELECT `roles`.* FROM `roles` INNER JOIN `roles_users` ON `roles`.`id` = `roles_users`.`role_id` WHERE `roles_users`.`user_id` = 1
---
  def index?
    @user.roles.each do |u|