app/views/auth/topics/show.html.erb

SELECT `questions`.* FROM `questions` WHERE `questions`.`topic_id` = 10
---
  <strong>Title: <%= @topic.title %></strong>
  <% @topic.questions.each do |q| %>